document.addEventListener('DOMContentLoaded', function() {
    var templateNews = document.getElementById('news-template').innerHTML;

    var allNews = {
        news: [
            { image: "./assets/img/news/news_1.jpg", title: "184-ти път Октоберфест!", text: "Прочутият празник на бирата 'Октоберфест' започна в Мюнхен за 184-ти път. Точно на обед кметът на аварската столица Дитер Райтер заби канелката на първото буре със специален чук." },
            { image: "./assets/img/news/news_2.jpg", title: "Патета с полицейски ескорт", text: "Полицай ескортира патица и нейните малки, за да пресекат пернатите улица в САЩ. Впечатляващият момент е заснет в Уилямс каунти, в щата Северна Дакота." },
            { image: "./assets/img/news/news_3.jpg", title: "Какво смятат жените за най-романтичен жест?", text: "Ако искате да спечелите сърцето на дамата, забравете цветята. В представите на съвременните жени най-романтичният жест е да получат храна за вкъщи." },
            { image: "./assets/img/news/news_4.jpg", title: "Плешивците излъчват повече мъжественост", text: "Плешивите мъже се възприемат от околните като по-мъжествени, по-властни и доста по-силни физически." },
            { image: "./assets/img/news/news_5.jpg", title: "Прасета плуват като торпили в Черно море", text: "Група диви прасета плуват в Черно море. Видеото е заснето преди година от бургазлията Пламен Петков в района на Приморско" },
            { image: "./assets/img/news/news_6.jpg", title: "Викингите са имали вожд жена", text: "Намерените до шведското езеро Меларен останки от древен скандинавски вожд са женски. Статия за това публикува American Journal of Physical Anthropology." },
            { image: "./assets/img/news/news_7.jpg", title: "Ето как звучи „Деспасито” само на два калкулатора", text: "Видео на японски музикант, изпълняващ нашумелият хит 'Деспасито' само на два калкулатора, събра близо 200 000 гледания в 'Ютюб' само три дни." }
        ]
    }

    var template = Handlebars.compile(templateNews);
    var readyHTML = template(allNews);
    document.getElementById('displayNews').innerHTML = readyHTML;
});